{"format": "graph-model", "generatedBy": "2.7.0", "convertedBy": "TensorFlow.js Converter v2.8.0", "signature": {"inputs": {"input_3:0": {"name": "input_3:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "224"}, {"size": "224"}, {"size": "1"}]}}}, "outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "224"}, {"size": "224"}, {"size": "1"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/model_2/conv2d_transpose_14/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model_2/conv2d_transpose_14/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_2/conv2d_transpose_14/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_2/conv2d_transpose_14/stack/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_2/conv2d_transpose_14/stack/2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_2/conv2d_transpose_14/stack/3", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_2/conv2d_transpose_14/conv2d_transpose/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "1"}, {"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_26/conv2d_transpose_13/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_26/conv2d_transpose_13/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_26/conv2d_transpose_13/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_26/conv2d_transpose_13/stack/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_2/sequential_26/conv2d_transpose_13/stack/2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_2/sequential_26/conv2d_transpose_13/stack/3", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_2/sequential_26/conv2d_transpose_13/conv2d_transpose/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "160"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_25/conv2d_transpose_12/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_25/conv2d_transpose_12/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model_2/sequential_25/conv2d_transpose_12/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_25/conv2d_transpose_12/stack/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_2/sequential_25/conv2d_transpose_12/stack/2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_2/sequential_25/conv2d_transpose_12/stack/3", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_2/sequential_25/conv2d_transpose_12/conv2d_transpose/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "96"}, {"size": "224"}]}}}}}, {"name": "StatefulPartitionedCall/model_2/sequential_24/conv2d_transpose_11/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model_2/sequential_24/conv2d_transpose_11/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model_2/sequential_24/conv2d_transpose_11/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model_2/sequential_24/conv2d_transpose_11/stack/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_2/sequential_24/conv2d_transpose_11/stack/2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_2/sequential_24/conv2d_transpose_11/stack/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_24/conv2d_transpose_11/conv2d_transpose/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "288"}]}}}}}, {"name": "StatefulPartitionedCall/model_2/sequential_23/conv2d_transpose_10/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_23/conv2d_transpose_10/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model_2/sequential_23/conv2d_transpose_10/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_23/conv2d_transpose_10/stack/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_23/conv2d_transpose_10/stack/2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_2/sequential_23/conv2d_transpose_10/stack/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_23/conv2d_transpose_10/conv2d_transpose/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "160"}, {"size": "160"}]}}}}}, {"name": "StatefulPartitionedCall/model_2/concatenate_2/concat/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_2/concatenate_2/concat_1/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_2/concatenate_2/concat_2/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_2/sequential_18/conv2d_10/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "1"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/concatenate_2/concat_3/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_2/conv2d_transpose_14/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input_3", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "224"}, {"size": "224"}, {"size": "1"}]}}}}, {"name": "StatefulPartitionedCall/model_2/sequential_19/conv2d_11/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/model_2/sequential_24/batch_normalization_21/FusedBatchNormV3/Offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model_2/sequential_19/conv2d_11/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_20/conv2d_12/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "96"}]}}}}}, {"name": "StatefulPartitionedCall/model_2/sequential_20/conv2d_12/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}}}, {"name": "StatefulPartitionedCall/model_2/sequential_21/conv2d_13/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "96"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model_2/sequential_23/batch_normalization_20/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "160"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_21/conv2d_13/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_22/conv2d_14/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "160"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_22/conv2d_14/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "160"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_23/batch_normalization_20/FusedBatchNormV3/Offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "160"}]}}}}}, {"name": "StatefulPartitionedCall/model_2/sequential_26/batch_normalization_23/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/model_2/sequential_26/batch_normalization_23/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_25/batch_normalization_22/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}}}, {"name": "StatefulPartitionedCall/model_2/sequential_25/batch_normalization_22/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_24/batch_normalization_21/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_18/conv2d_10/Conv2D", "op": "Conv2D", "input": ["input_3", "StatefulPartitionedCall/model_2/sequential_18/conv2d_10/Conv2D/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/model_2/sequential_18/leaky_re_lu_10/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/model_2/sequential_18/conv2d_10/Conv2D"], "attr": {"alpha": {"f": 0.3}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_19/leaky_re_lu_11/LeakyRelu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_2/sequential_18/leaky_re_lu_10/LeakyRelu", "StatefulPartitionedCall/model_2/sequential_19/conv2d_11/Conv2D_weights", "StatefulPartitionedCall/model_2/sequential_19/conv2d_11/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"leakyrelu_alpha": {"f": 0.3}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "use_cudnn_on_gpu": {"b": true}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/model_2/sequential_20/leaky_re_lu_12/LeakyRelu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_2/sequential_19/leaky_re_lu_11/LeakyRelu", "StatefulPartitionedCall/model_2/sequential_20/conv2d_12/Conv2D_weights", "StatefulPartitionedCall/model_2/sequential_20/conv2d_12/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "epsilon": {"f": 0.0}, "data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "leakyrelu_alpha": {"f": 0.3}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_21/leaky_re_lu_13/LeakyRelu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_2/sequential_20/leaky_re_lu_12/LeakyRelu", "StatefulPartitionedCall/model_2/sequential_21/conv2d_13/Conv2D_weights", "StatefulPartitionedCall/model_2/sequential_21/conv2d_13/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.3}, "epsilon": {"f": 0.0}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_22/leaky_re_lu_14/LeakyRelu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_2/sequential_21/leaky_re_lu_13/LeakyRelu", "StatefulPartitionedCall/model_2/sequential_22/conv2d_14/Conv2D_weights", "StatefulPartitionedCall/model_2/sequential_22/conv2d_14/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"use_cudnn_on_gpu": {"b": true}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "leakyrelu_alpha": {"f": 0.3}, "explicit_paddings": {"list": {}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/model_2/sequential_23/conv2d_transpose_10/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/model_2/sequential_22/leaky_re_lu_14/LeakyRelu"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_23/conv2d_transpose_10/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model_2/sequential_23/conv2d_transpose_10/Shape", "StatefulPartitionedCall/model_2/sequential_23/conv2d_transpose_10/strided_slice/stack", "StatefulPartitionedCall/model_2/sequential_23/conv2d_transpose_10/strided_slice/stack_1", "StatefulPartitionedCall/model_2/sequential_23/conv2d_transpose_10/strided_slice/stack_2"], "attr": {"end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_23/conv2d_transpose_10/stack", "op": "Pack", "input": ["StatefulPartitionedCall/model_2/sequential_23/conv2d_transpose_10/strided_slice", "StatefulPartitionedCall/model_2/sequential_23/conv2d_transpose_10/stack/1", "StatefulPartitionedCall/model_2/sequential_23/conv2d_transpose_10/stack/2", "StatefulPartitionedCall/model_2/sequential_23/conv2d_transpose_10/stack/3"], "attr": {"N": {"i": "4"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_23/conv2d_transpose_10/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/model_2/sequential_23/conv2d_transpose_10/stack", "StatefulPartitionedCall/model_2/sequential_23/conv2d_transpose_10/conv2d_transpose/ReadVariableOp", "StatefulPartitionedCall/model_2/sequential_22/leaky_re_lu_14/LeakyRelu"], "attr": {"T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "StatefulPartitionedCall/model_2/sequential_23/batch_normalization_20/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/model_2/sequential_23/conv2d_transpose_10/conv2d_transpose", "StatefulPartitionedCall/model_2/sequential_23/batch_normalization_20/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_23/batch_normalization_20/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/model_2/sequential_23/batch_normalization_20/FusedBatchNormV3/Mul", "StatefulPartitionedCall/model_2/sequential_23/batch_normalization_20/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_23/re_lu_8/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model_2/sequential_23/batch_normalization_20/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/concatenate_2/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/model_2/sequential_23/re_lu_8/Relu", "StatefulPartitionedCall/model_2/sequential_21/leaky_re_lu_13/LeakyRelu", "StatefulPartitionedCall/model_2/concatenate_2/concat/axis"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_24/conv2d_transpose_11/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/model_2/concatenate_2/concat"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_24/conv2d_transpose_11/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model_2/sequential_24/conv2d_transpose_11/Shape", "StatefulPartitionedCall/model_2/sequential_24/conv2d_transpose_11/strided_slice/stack", "StatefulPartitionedCall/model_2/sequential_24/conv2d_transpose_11/strided_slice/stack_1", "StatefulPartitionedCall/model_2/sequential_24/conv2d_transpose_11/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_24/conv2d_transpose_11/stack", "op": "Pack", "input": ["StatefulPartitionedCall/model_2/sequential_24/conv2d_transpose_11/strided_slice", "StatefulPartitionedCall/model_2/sequential_24/conv2d_transpose_11/stack/1", "StatefulPartitionedCall/model_2/sequential_24/conv2d_transpose_11/stack/2", "StatefulPartitionedCall/model_2/sequential_24/conv2d_transpose_11/stack/3"], "attr": {"axis": {"i": "0"}, "T": {"type": "DT_INT32"}, "N": {"i": "4"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_24/conv2d_transpose_11/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/model_2/sequential_24/conv2d_transpose_11/stack", "StatefulPartitionedCall/model_2/sequential_24/conv2d_transpose_11/conv2d_transpose/ReadVariableOp", "StatefulPartitionedCall/model_2/concatenate_2/concat"], "attr": {"padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "StatefulPartitionedCall/model_2/sequential_24/batch_normalization_21/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/model_2/sequential_24/conv2d_transpose_11/conv2d_transpose", "StatefulPartitionedCall/model_2/sequential_24/batch_normalization_21/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_24/batch_normalization_21/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/model_2/sequential_24/batch_normalization_21/FusedBatchNormV3/Mul", "StatefulPartitionedCall/model_2/sequential_24/batch_normalization_21/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_24/re_lu_9/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model_2/sequential_24/batch_normalization_21/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/concatenate_2/concat_1", "op": "ConcatV2", "input": ["StatefulPartitionedCall/model_2/sequential_24/re_lu_9/Relu", "StatefulPartitionedCall/model_2/sequential_20/leaky_re_lu_12/LeakyRelu", "StatefulPartitionedCall/model_2/concatenate_2/concat_1/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_25/conv2d_transpose_12/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/model_2/concatenate_2/concat_1"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_25/conv2d_transpose_12/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model_2/sequential_25/conv2d_transpose_12/Shape", "StatefulPartitionedCall/model_2/sequential_25/conv2d_transpose_12/strided_slice/stack", "StatefulPartitionedCall/model_2/sequential_25/conv2d_transpose_12/strided_slice/stack_1", "StatefulPartitionedCall/model_2/sequential_25/conv2d_transpose_12/strided_slice/stack_2"], "attr": {"T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_25/conv2d_transpose_12/stack", "op": "Pack", "input": ["StatefulPartitionedCall/model_2/sequential_25/conv2d_transpose_12/strided_slice", "StatefulPartitionedCall/model_2/sequential_25/conv2d_transpose_12/stack/1", "StatefulPartitionedCall/model_2/sequential_25/conv2d_transpose_12/stack/2", "StatefulPartitionedCall/model_2/sequential_25/conv2d_transpose_12/stack/3"], "attr": {"N": {"i": "4"}, "T": {"type": "DT_INT32"}, "axis": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_25/conv2d_transpose_12/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/model_2/sequential_25/conv2d_transpose_12/stack", "StatefulPartitionedCall/model_2/sequential_25/conv2d_transpose_12/conv2d_transpose/ReadVariableOp", "StatefulPartitionedCall/model_2/concatenate_2/concat_1"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/model_2/sequential_25/batch_normalization_22/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/model_2/sequential_25/conv2d_transpose_12/conv2d_transpose", "StatefulPartitionedCall/model_2/sequential_25/batch_normalization_22/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_25/batch_normalization_22/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/model_2/sequential_25/batch_normalization_22/FusedBatchNormV3/Mul", "StatefulPartitionedCall/model_2/sequential_25/batch_normalization_22/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_25/re_lu_10/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model_2/sequential_25/batch_normalization_22/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/concatenate_2/concat_2", "op": "ConcatV2", "input": ["StatefulPartitionedCall/model_2/sequential_25/re_lu_10/Relu", "StatefulPartitionedCall/model_2/sequential_19/leaky_re_lu_11/LeakyRelu", "StatefulPartitionedCall/model_2/concatenate_2/concat_2/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_26/conv2d_transpose_13/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/model_2/concatenate_2/concat_2"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_26/conv2d_transpose_13/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model_2/sequential_26/conv2d_transpose_13/Shape", "StatefulPartitionedCall/model_2/sequential_26/conv2d_transpose_13/strided_slice/stack", "StatefulPartitionedCall/model_2/sequential_26/conv2d_transpose_13/strided_slice/stack_1", "StatefulPartitionedCall/model_2/sequential_26/conv2d_transpose_13/strided_slice/stack_2"], "attr": {"end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_26/conv2d_transpose_13/stack", "op": "Pack", "input": ["StatefulPartitionedCall/model_2/sequential_26/conv2d_transpose_13/strided_slice", "StatefulPartitionedCall/model_2/sequential_26/conv2d_transpose_13/stack/1", "StatefulPartitionedCall/model_2/sequential_26/conv2d_transpose_13/stack/2", "StatefulPartitionedCall/model_2/sequential_26/conv2d_transpose_13/stack/3"], "attr": {"axis": {"i": "0"}, "T": {"type": "DT_INT32"}, "N": {"i": "4"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_26/conv2d_transpose_13/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/model_2/sequential_26/conv2d_transpose_13/stack", "StatefulPartitionedCall/model_2/sequential_26/conv2d_transpose_13/conv2d_transpose/ReadVariableOp", "StatefulPartitionedCall/model_2/concatenate_2/concat_2"], "attr": {"T": {"type": "DT_FLOAT"}, "use_cudnn_on_gpu": {"b": true}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/model_2/sequential_26/batch_normalization_23/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/model_2/sequential_26/conv2d_transpose_13/conv2d_transpose", "StatefulPartitionedCall/model_2/sequential_26/batch_normalization_23/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_26/batch_normalization_23/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/model_2/sequential_26/batch_normalization_23/FusedBatchNormV3/Mul", "StatefulPartitionedCall/model_2/sequential_26/batch_normalization_23/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_26/re_lu_11/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model_2/sequential_26/batch_normalization_23/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/concatenate_2/concat_3", "op": "ConcatV2", "input": ["StatefulPartitionedCall/model_2/sequential_26/re_lu_11/Relu", "StatefulPartitionedCall/model_2/sequential_18/leaky_re_lu_10/LeakyRelu", "StatefulPartitionedCall/model_2/concatenate_2/concat_3/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/model_2/conv2d_transpose_14/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/model_2/concatenate_2/concat_3"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/conv2d_transpose_14/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model_2/conv2d_transpose_14/Shape", "StatefulPartitionedCall/model_2/conv2d_transpose_14/strided_slice/stack", "StatefulPartitionedCall/model_2/conv2d_transpose_14/strided_slice/stack_1", "StatefulPartitionedCall/model_2/conv2d_transpose_14/strided_slice/stack_2"], "attr": {"new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_2/conv2d_transpose_14/stack", "op": "Pack", "input": ["StatefulPartitionedCall/model_2/conv2d_transpose_14/strided_slice", "StatefulPartitionedCall/model_2/conv2d_transpose_14/stack/1", "StatefulPartitionedCall/model_2/conv2d_transpose_14/stack/2", "StatefulPartitionedCall/model_2/conv2d_transpose_14/stack/3"], "attr": {"axis": {"i": "0"}, "N": {"i": "4"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_2/conv2d_transpose_14/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/model_2/conv2d_transpose_14/stack", "StatefulPartitionedCall/model_2/conv2d_transpose_14/conv2d_transpose/ReadVariableOp", "StatefulPartitionedCall/model_2/concatenate_2/concat_3"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/model_2/conv2d_transpose_14/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/model_2/conv2d_transpose_14/conv2d_transpose", "StatefulPartitionedCall/model_2/conv2d_transpose_14/BiasAdd/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/model_2/conv2d_transpose_14/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/model_2/conv2d_transpose_14/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/model_2/conv2d_transpose_14/Tanh"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 898}}, "weightsManifest": [{"paths": ["group1-shard1of2.bin", "group1-shard2of2.bin"], "weights": [{"name": "StatefulPartitionedCall/model_2/conv2d_transpose_14/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_2/conv2d_transpose_14/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_2/conv2d_transpose_14/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_2/conv2d_transpose_14/stack/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_2/conv2d_transpose_14/stack/2", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_2/conv2d_transpose_14/stack/3", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_2/conv2d_transpose_14/conv2d_transpose/ReadVariableOp", "shape": [3, 3, 1, 96], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_2/sequential_26/conv2d_transpose_13/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_2/sequential_26/conv2d_transpose_13/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_2/sequential_26/conv2d_transpose_13/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_2/sequential_26/conv2d_transpose_13/stack/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_2/sequential_26/conv2d_transpose_13/stack/2", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_2/sequential_26/conv2d_transpose_13/stack/3", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_2/sequential_26/conv2d_transpose_13/conv2d_transpose/ReadVariableOp", "shape": [3, 3, 64, 160], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_2/sequential_25/conv2d_transpose_12/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_2/sequential_25/conv2d_transpose_12/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_2/sequential_25/conv2d_transpose_12/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_2/sequential_25/conv2d_transpose_12/stack/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_2/sequential_25/conv2d_transpose_12/stack/2", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_2/sequential_25/conv2d_transpose_12/stack/3", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_2/sequential_25/conv2d_transpose_12/conv2d_transpose/ReadVariableOp", "shape": [3, 3, 96, 224], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_2/sequential_24/conv2d_transpose_11/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_2/sequential_24/conv2d_transpose_11/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_2/sequential_24/conv2d_transpose_11/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_2/sequential_24/conv2d_transpose_11/stack/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_2/sequential_24/conv2d_transpose_11/stack/2", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_2/sequential_24/conv2d_transpose_11/stack/3", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_2/sequential_24/conv2d_transpose_11/conv2d_transpose/ReadVariableOp", "shape": [3, 3, 128, 288], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_2/sequential_23/conv2d_transpose_10/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_2/sequential_23/conv2d_transpose_10/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_2/sequential_23/conv2d_transpose_10/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_2/sequential_23/conv2d_transpose_10/stack/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_2/sequential_23/conv2d_transpose_10/stack/2", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_2/sequential_23/conv2d_transpose_10/stack/3", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_2/sequential_23/conv2d_transpose_10/conv2d_transpose/ReadVariableOp", "shape": [3, 3, 160, 160], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_2/concatenate_2/concat/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_2/concatenate_2/concat_1/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_2/concatenate_2/concat_2/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_2/sequential_18/conv2d_10/Conv2D/ReadVariableOp", "shape": [3, 3, 1, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_2/concatenate_2/concat_3/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_2/conv2d_transpose_14/BiasAdd/ReadVariableOp", "shape": [1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_2/sequential_19/conv2d_11/Conv2D_weights", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_2/sequential_24/batch_normalization_21/FusedBatchNormV3/Offset", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_2/sequential_19/conv2d_11/Conv2D_bn_offset", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_2/sequential_20/conv2d_12/Conv2D_weights", "shape": [3, 3, 64, 96], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_2/sequential_20/conv2d_12/Conv2D_bn_offset", "shape": [96], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_2/sequential_21/conv2d_13/Conv2D_weights", "shape": [3, 3, 96, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_2/sequential_23/batch_normalization_20/FusedBatchNormV3/Scaled", "shape": [160], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_2/sequential_21/conv2d_13/Conv2D_bn_offset", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_2/sequential_22/conv2d_14/Conv2D_weights", "shape": [3, 3, 128, 160], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_2/sequential_22/conv2d_14/Conv2D_bn_offset", "shape": [160], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_2/sequential_23/batch_normalization_20/FusedBatchNormV3/Offset", "shape": [160], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_2/sequential_26/batch_normalization_23/FusedBatchNormV3/Scaled", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_2/sequential_26/batch_normalization_23/FusedBatchNormV3/Offset", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_2/sequential_25/batch_normalization_22/FusedBatchNormV3/Scaled", "shape": [96], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_2/sequential_25/batch_normalization_22/FusedBatchNormV3/Offset", "shape": [96], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_2/sequential_24/batch_normalization_21/FusedBatchNormV3/Scaled", "shape": [128], "dtype": "float32"}]}]}